// // --створити масив з:
// // - з 5 числових значень
// // - з 5 стічкових значень
// // - з 5 значень стрічкового, числового та булевого типу
// // - та вивести його в консоль
// let arrNum = [];
// for (let i = 0; i < 5; i++) {
//     arrNum[i] = i;
// }
// console.log(arrNum);
//
//
// let arrString = [];
// for (let i = 0; i < 5; i++) {
//     arrString[i] = `${i}`;
//
// }
// console.log(arrString, typeof arrString[0]);
//
// let arrBooStrNum = [];
// for (let i = 0; i < 5; i++) {
//     if (i <= 1) {
//         arrBooStrNum[i] = `${i}`
//
//     } else if (i >= 2 && i <= 3) {
//         arrBooStrNum[i] = i;
//     } else {
//         arrBooStrNum[i] = true;
//     }
//
// }
//
// console.log(arrBooStrNum,
//     typeof arrBooStrNum[0],
//     typeof arrBooStrNum[1],
//     typeof arrBooStrNum[2],
//     typeof arrBooStrNum[3],
//     typeof arrBooStrNum[4]
// );
//
// // -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let users = [];
//
// for (let i = 0; i < 6; i++) {
//
//     users[0] = 'a'
//     users[1] = 'b'
//     users[2] = 'c'
//     users[3] = 'd'
//     users[4] = 'e'
//     users[5] = 'f'
//
// }
//
// console.log(users);
//
// // - є масив [2,17,13,6,22,31,45,66,100,-18] :
// let numArr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// // 1. перебрати його циклом while
//
// let i = 0;
// while (i < numArr.length) {
//
//     console.log(numArr[i]);
//
//     i++;
// }
// // 2. перебрати його циклом for
// for (const number of numArr) {
//     console.log(number);
// }
// // 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// console.log(numArr);
// let j = 0;
// while (j < numArr.length) {
//     if (j % 2 !== 0) {
//         console.log(numArr[j]);
//     }
//     j++
// }
// // 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// console.log(numArr);
// for (let k = 0; k < numArr.length; k++) {
//
//     if (k % 2 !== 0) {
//         console.log(numArr[k])
//     }
// }
//
// // 5. перебрати циклом while та вивести  числа тільки парні  значення
// console.log(numArr);
// let u = 0;
// while (u < numArr.length) {
//     if (numArr[u] % 2 === 0) {
//         console.log(numArr[u]);
//     }
//     u++
// }
// // 6. перебрати циклом for та вивести  числа тільки парні  значення
// console.log(numArr);
// for (const number of numArr) {
//     if (number % 2 === 0) {
//         console.log(number);
//
//     }
// }
// // 7. замінити кожне число кратне 3 на слово "okten"
// // let numArr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (let g = 0; g < numArr.length; g++) {
//     const numArrElement = numArr[g];
//     if (numArrElement % 3 === 0) {
//         console.log(numArrElement);
//         numArr[g] = "okten";
//     }
// }
// console.log(numArr);

// 8. вивести масив в зворотньому порядку.
let numArr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let q = numArr.length - 1; q >= 0; q--) {
    const numArrElement = numArr[q];
    console.log(numArr);
}


// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// if (numArr[j]%2){
//     console.log(numArr[j]);
// }

//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор